// Данные уровней. x, y — центр отличия (доля от ширины/высоты картинки, 0..1),
// r — радиус зоны нажатия (доля от ширины картинки).
window.LEVELS = [
  {
    "name": "Маркет скинов",
    "a": "level1-a.jpg",
    "b": "level1-b.jpg",
    "diffs": [
      {
        "x": 0.2335,
        "y": 0.1618,
        "r": 0.07
      },
      {
        "x": 0.5668,
        "y": 0.4494,
        "r": 0.0575
      },
      {
        "x": 0.6742,
        "y": 0.6854,
        "r": 0.0552
      },
      {
        "x": 0.9632,
        "y": 0.318,
        "r": 0.044
      },
      {
        "x": 0.7597,
        "y": 0.2719,
        "r": 0.043
      }
    ]
  },
  {
    "name": "Энергетики",
    "a": "level2-a.jpg",
    "b": "level2-b.jpg",
    "diffs": [
      {
        "x": 0.7627,
        "y": 0.1625,
        "r": 0.0701
      },
      {
        "x": 0.3422,
        "y": 0.5508,
        "r": 0.0227
      },
      {
        "x": 0.1975,
        "y": 0.425,
        "r": 0.0811
      },
      {
        "x": 0.4043,
        "y": 0.7109,
        "r": 0.0848
      },
      {
        "x": 0.1528,
        "y": 0.8969,
        "r": 0.0398
      }
    ]
  },
  {
    "name": "Скины Fortnite",
    "a": "level3-a.jpg",
    "b": "level3-b.jpg",
    "diffs": [
      {
        "x": 0.3492,
        "y": 0.0601,
        "r": 0.0648
      },
      {
        "x": 0.6508,
        "y": 0.7007,
        "r": 0.0498
      },
      {
        "x": 0.3492,
        "y": 0.3462,
        "r": 0.0659
      },
      {
        "x": 0.0492,
        "y": 0.0601,
        "r": 0.0658
      },
      {
        "x": 0.7525,
        "y": 0.3474,
        "r": 0.0628
      }
    ]
  }
];
